---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StructuralSectionCprofileFoldLength
source: html/ed10a3b0-ffe8-0d28-cfe5-01394688ca97.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StructuralSectionCprofileFoldLength Property

"Fold Length"

## Syntax (C#)
```csharp
public static ForgeTypeId StructuralSectionCprofileFoldLength { get; }
```